# AnalyticalLinkType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalLinkType Class
Members See Also
---
An object that specifies the analysis properties for an AnalyticalLink element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class AnalyticalLinkType : ElementType
```

Visual Basic
---
```text
Public Class AnalyticalLinkType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class AnalyticalLinkType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..AnalyticalLinkType
# See Also
AnalyticalLinkType Members
Autodesk.Revit.DB.Structure Namespace